/*
מיון בועות 
נגדיר פונקציה מקוצרת בשם בבלסורט
נגדיר משתנה זמני
נפתח לולאת דו וויל
נגדיר את הערך של המשתנה הזמני כפולס
נפתח לולאת פור
נגדיר את המשתנה i
כל עוד אורך המערך גדול מהמשתנה נוסיף למשתנה אחד
נבדוק תנאי איף
אם המקום הראשון במערך גדול מהמקום השני במערך
ניתן משתנה זמני נוסף 
temp
ונגדיר את המקום הראשון במערך כמשתנה הזה
 נגדיר את המערך במקום ה i
 כמערך במקום i ועוד 1
 ונגדיר אותו כ temp
ונגדיר את המשתנה הזמני הראשון כטרו
ואז נגיע לוויל של הלולאה אם המשתנה מכיל טרו נחזור על הלולאה
ברגע שהלולאת וייל תקבל פולס הפונקציה תחזיר לנו את המערך ממוין לפי גודל
נגדיר את המערך הנבדק
נגדיר משתנה שמכיל את הפונקציה 
 ונדפיס אותו עם סטרייד אופרטור 
*/

const bubbleSort = (arr) => {
    let swapped;
    do {
        swapped = false;
        for (let i = 0; i < arr.length; i++) {
            if (arr[i] > arr[i + 1]) {
                let temp = arr[i];
                arr[i] = arr[i + 1];
                arr[i + 1] = temp;
                swapped = true;
            }
        }
    } while (swapped);
    return arr;
};
let arr = [2, 5, 7, 9, 4, 6, 3, 4, 4, 6, 8, 1, 0];
let sortedArr = bubbleSort(arr);
console.log(...sortedArr)